package my.day07.c.random;

import java.util.Random;

public class Main_random {

	public static void main(String[] args) {

		// === 랜덤한 정수를 뽑아낸다. === //
		double random = Math.random();
		System.out.println("random => " + random);
		/*
		   random => 0.706174780797895
		   random => 0.11474002569536923
	       random => 0.01889583866240574
	       random => 0.5895000157417029
		 */
		
		/*
		   java.lang.Math.random() 메소드는
		   0.0 이상 1.0 미만의 실수(double) 값을 랜덤하게 나타내어주는 메소드이다.
		   	즉, 0.0 <= 임의의 난수(실수) < 1.0
		   	
		   1 부터 10 까지의 랜덤한 정수를 얻어와 본다.
		   
		   랜덤한 정수 = (int)(Math.random()*구간범위)  + 시작값;
		   
		   (int)(0.706174780797895 * (10-1+1)) + 1 => (int)(7.06174780797895) + 1 ==> 7 + 1 ==> 8
		   (int)(0.11474002569536923 * (10-1+1)) + 1 => (int)(1.1474002569536923) + 1 ==> 1 + 1 ==> 2
		   (int)(0.01889583866240574 * (10-1+1)) + 1 => (int)(0.1889583866240574) + 1 ==> 0 + 1 ==> 1
		   (int)(0.5895000157417029 * (10-1+1)) + 1 ==> (int)(5.895000157417029) + 1 ==> 5 + 1 ==> 6

-------------------------------------------------------------------------------------------------------------------
		   
		   2 부터 5 까지의 랜덤한 정수를 얻어와 본다.
		   
		   랜덤한 정수 = (int)(Math.random()*구간범위) + 시작값;
		   
		   (int)(0.706174780797895 * (5-2+1)) + 2 => (int)(2.82469912319158) + 2 ==> 2 + 2 ==> 4
		   (int)(0.11474002569536923 * (5-2+1)) + 2 => (int)(0.4589601027814769) + 2 ==> 0 + 2 ==> 2
		   (int)(0.01889583866240574 * (5-2+1)) + 2 => (int)(0.07558335464962296) + 2 ==> 0 + 2 ==> 2
		   (int)(0.5895000157417029 * (5-2+1)) + 2 ==> (int)(2.3580000629668114) + 2 ==> 2 + 2 ==> 4
		   
		   0.0 <= 임의의 난수(실수) < 1.0
		 */
		
		// 랜덤한 정수 = (int)(Math.random()*구간범위) + 시작값;
		
		double rnd = Math.random();
		
		int n1 = (int)(rnd*(10-1+1)) + 1; // 1 부터 10 까지 중 랜덤하게 발생한 값 
		int n2 = (int)(rnd*(7-3+1)) + 3; // 3 부터 7 까지 중 랜덤하게 발생한 값 
		char ch = (char)((int)(rnd*('z'-'a'+1)) + 'a'); // a 부터 z 까지 중 랜덤하게 발생한 소문자 
		
		System.out.println("1 부터 10 까지 중 랜덤하게 발생한 값 : " + n1);
		System.out.println("3 부터 7 까지 중 랜덤하게 발생한 값 : " + n2);
		System.out.println("a 부터 z 까지 중 랜덤하게 발생한 소문자 : " + ch);
		
		
		System.out.println("\n===== new Random() 을 사용한 것 ======\n");

		// === 랜덤한 정수를 뽑아낸다. === //		
		// Math.random(); 이 해킹된 적 있기 때문에 new Random() 을 권장한다.
		Random rndom = new Random();
		
		// 처음 얼마부터 마지막 얼마까지 랜덤한 정수
		// ==> rndom.nextInt(마지막 수 - 처음 수 + 1) + 처음 수;

		n1 = rndom.nextInt(10 - 1 + 1) + 1;
		n2 = rndom.nextInt(7 - 3 + 1) + 3;
		ch = (char)(rndom.nextInt('z' - 'a' + 1) + 'a');
		
		System.out.println("1 부터 10 까지 중 랜덤하게 발생한 값 : " + n1);
		System.out.println("3 부터 7 까지 중 랜덤하게 발생한 값 : " + n2);
		System.out.println("a 부터 z 까지 중 랜덤하게 발생한 소문자 : " + ch);
		
		
	} // end of main() ----------------------------------------------

}
